brew 'aws-cdk'
brew 'awscli'
brew 'azure-cli'
brew 'docker-compose'
brew 'git'
brew 'gh'
brew 'gnupg'
brew 'gnupg2'
brew 'fswatch'
brew 'fzf'
brew 'minikube'
brew 'openssh'
brew 'postgres'
brew 'pure'
brew 'shellcheck'
brew 'telnet'
brew 'terraform'
brew 'zsh-autosuggestions'

cask 'docker'
cask 'vagrant'
cask 'virtualbox'

unless ENV['NO_JAVA']
  brew 'maven'
  brew 'openjdk'

  cask 'eclipse-java'
end